# Acces Financial Data through 'iex' API with Pandas_datareader

Visualizing data analysis of stock prices

### Imports

In [1]:
#classics
import pandas as pd
import numpy as np

In [2]:
#import pandas_datareader to acces the finance APIs
import pandas_datareader.data as web
import datetime

### IEX only allows to get the data up to 5 years

In [3]:
#define  the time interval 
start = datetime.datetime(2014,1,1)
end = datetime.datetime(2016,1,1)

### Get the Data

We will be using the stock index of **Ford**, **Apple** and **Starbucks** during the defined timelapse

**Ford Data : **

In [4]:
f = web.DataReader('F', 'iex', start, end)

In [5]:
f.head(10)

               open     high      low    close    volume
date
2014-01-02  11.8603  11.8833  11.7526  11.8756  31544161
2014-01-03  11.9372  12.0295  11.7680  11.9295  46128798
2014-01-06  12.0910  12.1218  11.9372  11.9833  42672711
2014-01-07  12.0987  12.1064  11.8064  11.8295  54797493
2014-01-08  11.9987  12.0833  11.9295  11.9525  48519024
2014-01-09  12.1756  12.3217  12.1295  12.1833  68016443
2014-01-10  12.3140  12.3910  12.2602  12.3602  45141418
2014-01-13  12.5909  12.7140  12.3679  12.3910  57736069
2014-01-14  12.5448  12.6371  12.4371  12.6140  44158912
2014-01-15  12.5909  12.8678  12.5756  12.8448  64167826

**Apple Data : **

In [6]:
apple = web.DataReader('AAPL','iex',start,end)

In [7]:
apple.head()

               open     high      low    close     volume
date
2014-01-02  72.8554  73.0324  72.3757  72.5211   58791957
2014-01-03  72.4857  72.5958  70.8560  70.9281   98303870
2014-01-06  70.4653  71.6912  69.9605  71.3149  103359151
2014-01-07  71.3660  71.5811  70.5276  70.8046   79432766
2014-01-08  70.6436  71.5286  70.6279  71.2533   64686685

**Starbucks Data:**

In [8]:
stx = web.DataReader('SBUX','iex',start,end)

In [9]:
stx.head()

               open     high      low    close    volume
date
2014-01-02  36.0862  36.1786  35.5939  35.6701   8528022
2014-01-03  35.8134  35.9475  35.5638  35.5685   6545626
2014-01-06  35.5453  35.7533  35.1340  35.2079  10604900
2014-01-07  35.4298  35.7811  35.3466  35.6886   8180398
2014-01-08  35.7210  36.1217  35.6794  36.0677  10190576